[{"Title":"Apple TV app updated with more improvements","Link":"https://emby.media/community/index.php?/blog/1/entry-424-apple-tv-app-updated-with-more-improvements/","Description":"Another update to our Apple TV app is rolling out and should be on a device near you soon.New Features / ImprovementsThe Favorites and Trailers tabs are now available in the Movies library:&nbsp;The Genres tab in the Movie library has been reworked to allow you to more easily navigate between genres with the Siri remote.&nbsp;The All, Trailers and Collections tabs have brand new sorting and filtering options.&nbsp;You can now shuffle a movie collection and it has been updated to provide details about a movie in the collection without having to go into its detail view:&nbsp;We have also made a few under the hood improvements that should make navigating between screens in the app a bit snappier.Enjoy!","DescriptionHtml":"<p>Another update to our Apple TV app is rolling out and should be on a device near you soon.<br /><span  style='color: rgb(40,40,40)'><span  style='font-family: Romboto'><br /><span  style='font-size: 18px'><strong class='bbc'>New Features / Improvements</strong></span></span></span><br /><span  style='color: rgb(40,40,40)'><span  style='font-family: Romboto'><br />The Favorites and Trailers tabs are now available in the Movies library:</span></span><br /><span  style='color: rgb(40,40,40)'><span  style='font-family: Romboto'><br /><span rel='lightbox'><img class='bbc_img' src='https://emby.media/community/uploads/inline/59/5ab1cf19a5e69_movietrailerstab.png' alt='Posted Image'  /></span></span></span></p><p>&nbsp;</p><p><span  style='color: rgb(40,40,40)'><span  style='font-family: Romboto'><br />The Genres tab in the Movie library has been reworked to allow you to more easily navigate between genres with the Siri remote.</span></span><br /><span  style='color: rgb(40,40,40)'><span  style='font-family: Romboto'><br /><span rel='lightbox'><img class='bbc_img' src='https://emby.media/community/uploads/inline/59/5adf324046692_moviegenres2.png' alt='Posted Image'  /></span></span></span></p><p>&nbsp;</p><p><span  style='color: rgb(40,40,40)'><span  style='font-family: Romboto'><br />The All, Trailers and Collections tabs have brand new sorting and filtering options.</span></span><br /><span  style='color: rgb(40,40,40)'><span  style='font-family: Romboto'><br /><span rel='lightbox'><img class='bbc_img' src='https://emby.media/community/uploads/inline/59/5adf34e76d0ec_SortingMovies.gif' alt='Posted Image'  /></span></span></span><br /><span  style='color: rgb(40,40,40)'><span  style='font-family: Romboto'><br /><span rel='lightbox'><img class='bbc_img' src='https://emby.media/community/uploads/inline/59/5adf347b4b7c4_FilteringMovies.gif' alt='Posted Image'  /></span></span></span></p><p>&nbsp;</p><p><span  style='color: rgb(40,40,40)'><span  style='font-family: Romboto'><br />You can now shuffle a movie collection and it has been updated to provide details about a movie in the collection without having to go into its detail view:</span></span><br /><span  style='color: rgb(40,40,40)'><span  style='font-family: Romboto'><br /><span rel='lightbox'><img class='bbc_img' src='https://emby.media/community/uploads/inline/59/5ab064d2a9408_moviecollectionview.png' alt='Posted Image'  /></span></span></span><br /><span  style='color: rgb(40,40,40)'><span  style='font-family: Romboto'><br /><span rel='lightbox'><img class='bbc_img' src='https://emby.media/community/uploads/inline/59/5ab064dde2d88_moviecollectionhover.png' alt='Posted Image'  /></span></span></span></p><p>&nbsp;</p><p><span  style='color: rgb(40,40,40)'><span  style='font-family: Romboto'><br />We have also made a few under the hood improvements that should make navigating between screens in the app a bit snappier.</span></span><br /><span  style='color: rgb(40,40,40)'><span  style='font-family: Romboto'><br />Enjoy!</span></span></p>","Date":"2018-05-10T12:59:30.0000000+00:00"},{"Title":"Emby Server 3.4 Released","Link":"https://emby.media/community/index.php?/blog/1/entry-423-emby-server-34-released/","Description":"A new release of Emby Server is currently rolling out. Here are the highlights.&nbsp;New Convert Media Feature&nbsp;Want to reduce on the fly transcoding? We now have a feature that can help you convert your library into streaming-friendly formats. It's easy, just right click or tap on a video and select Convert in the menu.&nbsp;&nbsp;Then specify the options you want:&nbsp;The media will then be converted and stored in the original media folder with the original item.&nbsp;Want to convert new content automatically as it gets added to your library? It's simple, just convert a folder such as a TV series, and then enable the option to automatically convert new content.&nbsp;&nbsp;Collection Changes&nbsp;The Collections folder has become a regular Emby library, which means that it now works nicely with all Emby features, including:Customizing the library imageUser permissions for the libraryAll other per-library settingsImportant: If you update and notice Collections are missing, please do the following:Run a library scanCheck your Emby user permissions for each user and make sure they are granted access to the Collections library&nbsp;New Per-Library Settings&nbsp;You can now control just about everything on a per-library basis. This includes:Preferred metadata providersPreferred metadata saversSubtitle downloadingImage downloadingImportant: We suggest you review your settings for each library to ensure they are correct following the upgrade.&nbsp;Support for DVD & Absolute Episode Ordering Per Series&nbsp;To use this, use the metadata editor to edit a series and specify the ordering that you prefer.&nbsp;&nbsp;Important: Tvdb will need to be your highest priority Series metadata provider (which it is by default).&nbsp;Import Music Playlists&nbsp;Emby Server now supports wpl, zpl, m3u and pls playlist files, even with relative paths !&nbsp;Wake For Recordings&nbsp;On Windows, Emby Server can now automatically wake the machine for a scheduled recording. You no longer need to worry about your server going to sleep and missing a recording !&nbsp;We hope to support this on more platforms in the future.&nbsp;NVENC Transcoding Improvements&nbsp;We've improved the performance of our NVENC hardware transcoding support. Additionally, our Linux x64 releases now include NVENC libraries, which means all you need to do is enable the feature in Emby Server transcoding settings.&nbsp;Important: We include NVENC libraries but not the hardware drivers. Please refer to your Linux distro for instructions on how to install NVENC hardware drivers.&nbsp;Improved Strm File Playback&nbsp;In most cases, you'll notice you can now resume video playback from .strm files, and subtitle and audio track switching should be fully supported now.&nbsp;Individual User Remote Access Control&nbsp;You can now grant or deny remote access on a per-user basis.&nbsp;New Remote IP Filter&nbsp;In advanced server settings, you can now configure remote ip filters to better control who can access your server.&nbsp;Improved Offline Media Support&nbsp;We've resolved various issues with the library scan removing offline media. If you're someone who frequently takes your storage offline, you'll appreciate these improvements.&nbsp;IMVDb Metadata Support&nbsp;We've added IMVDb support for music videos.&nbsp;Changes to Existing Features&nbsp;Cinema Mode, IMVDb, and Open Subtitles are now pre-installed plugins.&nbsp;&nbsp;As a plugin we're now able to update them in-between server releases, and you can also uninstall them completely if you don't intend to use them.&nbsp;SubDb Subtitle Downloader Moved to Plugin&nbsp;This has been moved to a plugin and is available in the Emby plugin catalog. Please make sure to install this if you wish to download subtitles from SubDb.&nbsp;Bug FixesFix https client certificate requirementFix various quirks when renaming librariesFix local port configuration in the web interfaceFix mouse cursor not hiding during video playbackFix android m3u playback in certain situationsFix SubDb download issue with very small video filesFix occasional error with https redirectAdd samsung dlna fixOther ImprovementsAdopt linux log file rotation patternsSupport nested collectionsUpdate multi-version display namesExpand user home screen settingsImprove library scan performanceAdd default live tv screen settingAdd play/shuffle on photo albumsDisplay HDR info on detail screensAdd play all & shuffle to list screensInclude series year in recording folder nameSupport relative paths in playlistsSupport version selection when playing to dlnaEnable Chromecast for OperaImprove series recordings for sportsImprove series recording imagesUpdate Identify feature to respect per library metadata settingsAdd music videos to Identify featureImprove parsing of CIDR notationAdd amf to hardware transcoding menuFix multiple ffmpeg instances spawning in safari when changing audio tracksReduce frequency of image encodingExclude default.ext from photo librariesuse wmc naming conventions for recordings with dates in file namesImprove performance of grouping movies into collectionsAdd new secure connections mode setting to hosting pageHandle videos with invalid framerate metadataSupport windows media center episode file namingAdd photo albums to search resultsUpdate to sqlite 3.23.1Improve add user workflow","DescriptionHtml":"<p>A new release of Emby Server is currently rolling out. Here are the highlights.</p><p>&nbsp;</p><p><span  style='font-size: 24px'>New Convert Media Feature</span></p><p>&nbsp;</p><p>Want to reduce on the fly transcoding? We now have a feature that can help you convert your library into streaming-friendly formats. It's easy, just right click or tap on a video and select Convert in the menu.</p><p>&nbsp;</p><p><span rel='lightbox'><img class='bbc_img' src='https://emby.media/community/uploads/inline/2/5aeb6eff15d53_Untitled.png' alt='Posted Image'  /></span></p><p>&nbsp;</p><p>Then specify the options you want:<br /><span rel='lightbox'><img class='bbc_img' src='https://emby.media/community/uploads/inline/2/5aeb6f27c936a_Untitled.png' alt='Posted Image'  /></span></p><p>&nbsp;</p><p>The media will then be converted and stored in the original media folder with the original item.</p><p>&nbsp;</p><p>Want to convert new content automatically as it gets added to your library? It's simple, just convert a folder such as a TV series, and then enable the option to automatically convert new content.</p><p>&nbsp;</p><p><span rel='lightbox'><img class='bbc_img' src='https://emby.media/community/uploads/inline/2/5aeb72ca0c72f_Untitled.png' alt='Posted Image'  /></span></p><p>&nbsp;</p><p><span  style='font-size: 24px'>Collection Changes</span></p><p>&nbsp;</p><p>The Collections folder has become a regular Emby library, which means that it now works nicely with all Emby features, including:<ul class='bbc'><li>Customizing the library image</li><li>User permissions for the library</li><li>All other per-library settings</li></ul><strong class='bbc'>Important</strong>: If you update and notice Collections are missing, please do the following:<ul class='bbc'><li>Run a library scan</li><li>Check your Emby user permissions for each user and make sure they are granted access to the Collections library</li></ul></p><p>&nbsp;</p><p><span  style='font-size: 24px'>New Per-Library Settings</span></p><p>&nbsp;</p><p>You can now control just about everything on a per-library basis. This includes:<ul class='bbc'><li>Preferred metadata providers</li><li>Preferred metadata savers</li><li>Subtitle downloading</li><li>Image downloading</li></ul><strong class='bbc'>Important</strong>: We suggest you review your settings for each library to ensure they are correct following the upgrade.</p><p>&nbsp;</p><p><span  style='font-size: 24px'>Support for DVD & Absolute Episode Ordering Per Series</span></p><p>&nbsp;</p><p>To use this, use the metadata editor to edit a series and specify the ordering that you prefer.</p><p>&nbsp;</p><p><span rel='lightbox'><img class='bbc_img' src='https://emby.media/community/uploads/inline/2/5aeb4adbd71d8_Untitled.png' alt='Posted Image'  /></span></p><p>&nbsp;</p><p><strong class='bbc'>Important</strong>: Tvdb will need to be your highest priority Series metadata provider (which it is by default).</p><p>&nbsp;</p><p><span  style='font-size: 24px'>Import Music Playlists</span></p><p>&nbsp;</p><p>Emby Server now supports wpl, zpl, m3u and pls playlist files, even with relative paths !</p><p>&nbsp;</p><p><span  style='font-size: 24px'>Wake For Recordings</span></p><p>&nbsp;</p><p>On Windows, Emby Server can now automatically wake the machine for a scheduled recording. You no longer need to worry about your server going to sleep and missing a recording !</p><p>&nbsp;</p><p>We hope to support this on more platforms in the future.</p><p>&nbsp;</p><p><span  style='font-size: 24px'>NVENC Transcoding Improvements</span></p><p>&nbsp;</p><p>We've improved the performance of our NVENC hardware transcoding support. Additionally, our Linux x64 releases now include NVENC libraries, which means all you need to do is enable the feature in Emby Server transcoding settings.</p><p>&nbsp;</p><p><strong class='bbc'>Important</strong>: We include NVENC libraries but not the hardware drivers. Please refer to your Linux distro for instructions on how to install NVENC hardware drivers.</p><p>&nbsp;</p><p><span  style='font-size: 24px'>Improved Strm File Playback</span></p><p>&nbsp;</p><p>In most cases, you'll notice you can now resume video playback from .strm files, and subtitle and audio track switching should be fully supported now.</p><p>&nbsp;</p><p><span  style='font-size: 24px'>Individual User Remote Access Control</span></p><p>&nbsp;</p><p>You can now grant or deny remote access on a per-user basis.<br /><span rel='lightbox'><img class='bbc_img' src='https://emby.media/community/uploads/inline/2/5aeb4a843ea51_Untitled.png' alt='Posted Image'  /></span></p><p>&nbsp;</p><p><span  style='font-size: 24px'>New Remote IP Filter</span></p><p>&nbsp;</p><p>In advanced server settings, you can now configure remote ip filters to better control who can access your server.</p><p>&nbsp;</p><p><span  style='font-size: 24px'>Improved Offline Media Support</span></p><p>&nbsp;</p><p>We've resolved various issues with the library scan removing offline media. If you're someone who frequently takes your storage offline, you'll appreciate these improvements.</p><p>&nbsp;</p><p><span  style='font-size: 24px'>IMVDb Metadata Support</span></p><p>&nbsp;</p><p>We've added IMVDb support for music videos.</p><p>&nbsp;</p><p><span  style='font-size: 24px'>Changes to Existing Features</span></p><p>&nbsp;</p><p>Cinema Mode, IMVDb, and Open Subtitles are now pre-installed plugins.</p><p>&nbsp;</p><p><span rel='lightbox'><img class='bbc_img' src='https://emby.media/community/uploads/inline/2/5aeb45c9b5469_Untitled.png' alt='Posted Image'  /></span></p><p>&nbsp;</p><p>As a plugin we're now able to update them in-between server releases, and you can also uninstall them completely if you don't intend to use them.</p><p>&nbsp;</p><p><span  style='font-size: 24px'>SubDb Subtitle Downloader Moved to Plugin</span></p><p>&nbsp;</p><p>This has been moved to a plugin and is available in the Emby plugin catalog. Please make sure to install this if you wish to download subtitles from SubDb.</p><p>&nbsp;</p><p><span  style='font-size: 24px'>Bug Fixes</span><ul class='bbc'><li>Fix https client certificate requirement</li><li>Fix various quirks when renaming libraries</li><li>Fix local port configuration in the web interface</li><li>Fix mouse cursor not hiding during video playback</li><li>Fix android m3u playback in certain situations</li><li>Fix SubDb download issue with very small video files</li><li>Fix occasional error with https redirect</li><li>Add samsung dlna fix</li></ul><span  style='font-size: 24px'>Other Improvements</span><ul class='bbc'><li>Adopt linux log file rotation patterns</li><li>Support nested collections</li><li>Update multi-version display names</li><li>Expand user home screen settings</li><li>Improve library scan performance</li><li>Add default live tv screen setting</li><li>Add play/shuffle on photo albums</li><li>Display HDR info on detail screens</li><li>Add play all & shuffle to list screens</li><li>Include series year in recording folder name</li><li>Support relative paths in playlists</li><li>Support version selection when playing to dlna</li><li>Enable Chromecast for Opera</li><li>Improve series recordings for sports</li><li>Improve series recording images</li><li>Update Identify feature to respect per library metadata settings</li><li>Add music videos to Identify feature</li><li>Improve parsing of CIDR notation</li><li>Add amf to hardware transcoding menu</li><li>Fix multiple ffmpeg instances spawning in safari when changing audio tracks</li><li>Reduce frequency of image encoding</li><li>Exclude default.ext from photo libraries</li><li>use wmc naming conventions for recordings with dates in file names</li><li>Improve performance of grouping movies into collections</li><li>Add new secure connections mode setting to hosting page</li><li>Handle videos with invalid framerate metadata</li><li>Support windows media center episode file naming</li><li>Add photo albums to search results</li><li>Update to sqlite 3.23.1</li><li>Improve add user workflow</li></ul></p>","Date":"2018-05-03T17:20:00.0000000+00:00"},{"Title":"Hey Google - What's your coolest new app?","Link":"https://emby.media/community/index.php?/blog/1/entry-422-hey-google-whats-your-coolest-new-app/","Description":"I'm so glad you asked. Why 'Emby' is the coolest personal media server on the planet and I can now control it for you. What would you like to do...?&nbsp;Your Emby system is now available to control with your Google Home device. Just install the Emby for Google Home app, link it to your Emby Connect account and then here are just a few of the things you can do with your voice:&nbsp;Okay Google...Ask Emby Home to&nbsp;Play the next episode of The Walking Dead on Emby Theater&nbsp;Suggest something to watch&nbsp;Play a few episodes of The Big Bang Theory&nbsp;Play songs by Adele&nbsp;Bring up Deadpool&nbsp;And after something is playing, you can do things like:&nbsp;Change the audio to English&nbsp;What's playing?&nbsp;The invocation phrase for the app is \"Emby Home\" so be sure to use that key phrase when trying to talk to your Emby system. Try it out now on your Google Home device. It is available worldwide. Complete instructions are here.","DescriptionHtml":"<p><span  style='font-size: 18px'><em class='bbc'>I'm so glad you asked. Why 'Emby' is the coolest personal media server on the planet and I can now control it for you. What would you like to do...?</em></span></p><p>&nbsp;</p><p>Your Emby system is now available to control with your Google Home device. Just <a href='https://github.com/MediaBrowser/Wiki/wiki/Google%20Home#get-started' class='bbc_url' title='External link' rel='nofollow external'>install</a> the Emby for Google Home app, <a href='https://github.com/MediaBrowser/Wiki/wiki/Google%20Home#google-home-account-linking' class='bbc_url' title='External link' rel='nofollow external'>link it to your Emby Connect account</a> and then here are just a few of the things you can do with your voice:</p><p>&nbsp;</p><p>Okay Google...Ask Emby Home to</p><p>&nbsp;</p><p><p class='bbc_indent'  style='margin-left: 40px'>Play the next episode of The Walking Dead on Emby Theater</p></p><p>&nbsp;</p><p><p class='bbc_indent'  style='margin-left: 40px'>Suggest something to watch</p></p><p>&nbsp;</p><p><p class='bbc_indent'  style='margin-left: 40px'>Play a few episodes of The Big Bang Theory</p></p><p>&nbsp;</p><p><p class='bbc_indent'  style='margin-left: 40px'>Play songs by Adele</p></p><p>&nbsp;</p><p><p class='bbc_indent'  style='margin-left: 40px'>Bring up Deadpool</p></p><p>&nbsp;</p><p>And after something is playing, you can do things like:</p><p>&nbsp;</p><p><p class='bbc_indent'  style='margin-left: 40px'>Change the audio to English</p></p><p>&nbsp;</p><p><p class='bbc_indent'  style='margin-left: 40px'>What's playing?</p></p><p>&nbsp;</p><p>The invocation phrase for the app is \"Emby Home\" so be sure to use that key phrase when trying to talk to your Emby system. Try it out now on your Google Home device. It is available worldwide. Complete instructions are <a href='https://github.com/MediaBrowser/Wiki/wiki/Google%20Home' class='bbc_url' title='External link' rel='nofollow external'>here</a>.</p>","Date":"2018-04-18T11:20:00.0000000+00:00"},{"Title":"Android TV Updated with common home screen layout and improved playback","Link":"https://emby.media/community/index.php?/blog/1/entry-421-android-tv-updated-with-common-home-screen-layout-and-improved-playback/","Description":"A new version of the Fire TV and Android TV apps is rolling out to a device near you now. This new version has several improvements so be sure to update as soon as it is available for your device.&nbsp;Common Home Screen Layout&nbsp;&nbsp;The app now follows the same home screen layout as the web, mobile and Theater apps. Each user can define the order of and what appears in each home screen section and these settings will carry across all of these apps. You can access these settings from any of the supported apps (including this one).&nbsp;Playback Improvements&nbsp;The internal Google player used by the app has been updated and improved to provide an even better playback experience and require even less transcoding on the server than before. For stereo setups, the app can now downmix internally so it doesn't have to ask the server to transcode or remux to do this conversion - freeing up your server resources for other tasks.&nbsp;Stats For Nerds&nbsp;&nbsp;The popular \"stats for nerds\" feature is now available in this app. To activate it, use the option in the playback OSD settings menu or long-press the \"select\" button on your remote. You can also turn it off in the same manner. Display of stats for nerds will be remembered for an entire login session.&nbsp;Improved Seeking Behavior&nbsp;It is now much easier to seek further into content quickly. By holding down the seek buttons on your remote, the app will progressively seek faster and faster - allowing you to jump hours ahead if necessary much quicker and easier than before&nbsp;New Season View&nbsp;&nbsp;The app now has an improved TV Season view that matches the other apps and provides easier access to information for each of the episodes within the season.&nbsp;Other Fixes and EnhancementsRefresh rate switching will now do a better job of matching rates that are \"close\"Organize settings into logical sectionsInclude photos and photo albums in search resultsUpdate language translations (thanks for community contributions!)Shuffle play entire libraries - you can now use the play button on your remote to shuffle play at the library levelInclude TV channels in search resultsStability improvements","DescriptionHtml":"<p>A new version of the Fire TV and Android TV apps is rolling out to a device near you now. This new version has several improvements so be sure to update as soon as it is available for your device.</p><p>&nbsp;</p><p><strong class='bbc'><span  style='font-size: 18px'>Common Home Screen Layout</span></strong></p><p>&nbsp;</p><p><span rel='lightbox'><img class='bbc_img' src='https://emby.media/community/uploads/inline/3/5acbb9bd88c76_newhomeannounce.png' alt='Posted Image'  /></span></p><p>&nbsp;</p><p>The app now follows the same home screen layout as the web, mobile and Theater apps. Each user can define the order of and what appears in each home screen section and these settings will carry across all of these apps. You can access these settings from any of the supported apps (including this one).</p><p>&nbsp;</p><p><strong class='bbc'><span  style='font-size: 18px'>Playback Improvements</span></strong></p><p>&nbsp;</p><p>The internal Google player used by the app has been updated and improved to provide an even better playback experience and require even less transcoding on the server than before. For stereo setups, the app can now downmix internally so it doesn't have to ask the server to transcode or remux to do this conversion - freeing up your server resources for other tasks.</p><p>&nbsp;</p><p><strong class='bbc'><span  style='font-size: 18px'>Stats For Nerds</span></strong></p><p>&nbsp;</p><p><span rel='lightbox'><img class='bbc_img' src='https://emby.media/community/uploads/inline/3/5acbbc295498e_statsfnerdsdirect.png' alt='Posted Image'  /></span></p><p>&nbsp;</p><p>The popular \"stats for nerds\" feature is now available in this app. To activate it, use the option in the playback OSD settings menu or long-press the \"select\" button on your remote. You can also turn it off in the same manner. Display of stats for nerds will be remembered for an entire login session.</p><p>&nbsp;</p><p><strong class='bbc'><span  style='font-size: 18px'>Improved Seeking Behavior</span></strong></p><p>&nbsp;</p><p>It is now much easier to seek further into content quickly. By holding down the seek buttons on your remote, the app will progressively seek faster and faster - allowing you to jump hours ahead if necessary much quicker and easier than before</p><p>&nbsp;</p><p><strong class='bbc'><span  style='font-size: 18px'>New Season View</span></strong></p><p>&nbsp;</p><p><span rel='lightbox'><img class='bbc_img' src='https://emby.media/community/uploads/inline/3/5acbbded332db_newseasonview.png' alt='Posted Image'  /></span></p><p>&nbsp;</p><p>The app now has an improved TV Season view that matches the other apps and provides easier access to information for each of the episodes within the season.</p><p>&nbsp;</p><p><strong class='bbc'><span  style='font-size: 18px'>Other Fixes and Enhancements</span></strong><ul class='bbc'><li>Refresh rate switching will now do a better job of matching rates that are \"close\"</li><li>Organize settings into logical sections</li><li>Include photos and photo albums in search results</li><li>Update language translations (thanks for community contributions!)</li><li>Shuffle play entire libraries - you can now use the play button on your remote to shuffle play at the library level</li><li>Include TV channels in search results</li><li>Stability improvements</li></ul></p>","Date":"2018-04-10T17:31:16.0000000+00:00"},{"Title":"Emby for LG Smart TV's 1.06 Released","Link":"https://emby.media/community/index.php?/blog/1/entry-420-emby-for-lg-smart-tvs-106-released/","Description":"A new release of Emby for LG is currently rolling out. Here are the highlights:Improved direct play of 4K, HDR and HEVC mediaImproved subtitle supportImproved navigation performanceSorting, filtering, and view settings added to list screens&nbsp;Sorting, Filtering and View Settings&nbsp;&nbsp;Improved Live TV & DVR Layouts&nbsp;&nbsp;","DescriptionHtml":"<p>A new release of Emby for LG is currently rolling out. Here are the highlights:<ul class='bbc'><li>Improved direct play of 4K, HDR and HEVC media</li><li>Improved subtitle support</li><li>Improved navigation performance</li><li>Sorting, filtering, and view settings added to list screens</li></ul></p><p>&nbsp;</p><p><span  style='font-size: 24px'>Sorting, Filtering and View Settings</span></p><p>&nbsp;</p><p><span rel='lightbox'><img class='bbc_img' src='https://emby.media/community/uploads/inline/2/5ab414b4a28a1_Untitled.png' alt='Posted Image'  /></span></p><p>&nbsp;</p><p><span  style='font-size: 24px'>Improved Live TV & DVR Layouts</span></p><p>&nbsp;</p><p><span rel='lightbox'><img class='bbc_img' src='https://emby.media/community/uploads/inline/2/5ab41477e4d12_Untitled.png' alt='Posted Image'  /></span></p><p>&nbsp;</p><p><span rel='lightbox'><img class='bbc_img' src='https://emby.media/community/uploads/inline/2/5ab4148dc1e11_Untitled.png' alt='Posted Image'  /></span></p>","Date":"2018-03-22T20:34:00.0000000+00:00"},{"Title":"Emby Server Now Available for TerraMaster NAS","Link":"https://emby.media/community/index.php?/blog/1/entry-419-emby-server-now-available-for-terramaster-nas/","Description":"Emby Server can now be installed on TerraMaster NAS devices. To install, simply browse the TerraMaster app store on your NAS and install Emby Server.&nbsp;\nPlease note the version in the TerraMaster app store may run a little behind the latest due to delays involved with the TerraMaster review process.","DescriptionHtml":"<p>Emby Server can now be installed on TerraMaster NAS devices. To install, simply browse the TerraMaster app store on your NAS and install Emby Server.</p><p>&nbsp;</p><p>\nPlease note the version in the TerraMaster app store may run a little behind the latest due to delays involved with the TerraMaster review process.</p>","Date":"2018-03-08T22:01:00.0000000+00:00"},{"Title":"Emby for Apple TV Update","Link":"https://emby.media/community/index.php?/blog/1/entry-418-emby-for-apple-tv-update/","Description":"A new update to the Emby Apple TV app has rolled out with several enhancements and fixes. They include:&nbsp;Home Screen Layout&nbsp;The app now follows the home screen settings you setup in user settings on the web or mobile apps. You cannot change these settings from this app yet so just use the web interface to set these how you wish. User Icon -&gt; Home Screen&nbsp;New Theme Setting&nbsp;The app now follows the Apple TV Light/Dark/Automatic theme settings. The internal setting has been removed. To change the Apple TV system theme go to Settings -&gt; General -&gt; Appearance.&nbsp;&nbsp;&nbsp;New Collections Tab&nbsp;A Collections tab was added to the Movies view.&nbsp;&nbsp;Detail Screen UpdatesYou can now mark a series as watched / unwatched.IMDB ratings have also been added to detail screens where appropriate.&nbsp;Bug FixesFixed the black icons on the playback overlayThe playback overlay missing overview bug has been fixedIn certain circumstances external subtitles could be skipped and this has been resolvedThe issue of external subtitles showing formatting characters such as &lt;i&gt; has been resolvedAddressed views being updated when items are deletedWe hope you enjoy these enhancements. We are hard at work on many more which will be available in the near future.","DescriptionHtml":"<p><span  style='color: rgb(40,40,40)'><span  style='font-family: Romboto'>A new update to the Emby Apple TV app has rolled out with several enhancements and fixes. They include:</span></span></p><p>&nbsp;</p><p><strong class='bbc'><span  style='font-size: 24px'><span  style='color: rgb(40,40,40)'><span  style='font-family: Romboto'>Home Screen Layout</span></span></span></strong></p><p>&nbsp;</p><p>The app now follows the home screen settings you setup in user settings on the web or mobile apps. You cannot change these settings from this app yet so just use the web interface to set these how you wish. User Icon -&gt; Home Screen</p><p>&nbsp;</p><p><span  style='color: rgb(40,40,40)'><span  style='font-family: Romboto'><span  style='font-size: 24px'><strong class='bbc'>New Theme Setting</strong></span></span></span></p><p>&nbsp;</p><p>The app now follows the Apple TV Light/Dark/Automatic theme settings. The internal setting has been removed. To change the Apple TV system theme go to Settings -&gt; General -&gt; Appearance.</p><p>&nbsp;</p><p><span  style='color: rgb(40,40,40)'><span  style='font-family: Romboto'><span rel='lightbox'><img class='bbc_img' src='https://emby.media/community/uploads/inline/59/5a99a68961b55_Light2.png' alt='Posted Image'  /></span></span></span></p><p>&nbsp;</p><p><span  style='color: rgb(40,40,40)'><span  style='font-family: Romboto'><span rel='lightbox'><img class='bbc_img' src='https://emby.media/community/uploads/inline/59/5a99a696486d6_Dark2.png' alt='Posted Image'  /></span></span></span></p><p>&nbsp;</p><p><strong class='bbc'><span  style='color: rgb(40,40,40)'><span  style='font-family: Romboto'><span  style='font-size: 24px'>New Collections Tab</span></span></span></strong></p><p>&nbsp;</p><p>A Collections tab was added to the Movies view.</p><p>&nbsp;</p><p><span  style='color: rgb(40,40,40)'><span  style='font-family: Romboto'><span rel='lightbox'><img class='bbc_img' src='https://emby.media/community/uploads/inline/59/5a9945baa5ddd_Collections.png' alt='Posted Image'  /></span></span></span></p><p>&nbsp;</p><p><strong class='bbc'><span  style='color: rgb(40,40,40)'><span  style='font-family: Romboto'><span  style='font-size: 24px'>Detail Screen Updates</span></span></span></strong><ul class='bbc'><li>You can now mark a series as watched / unwatched.</li><li>IMDB ratings have also been added to detail screens where appropriate.</li></ul><span  style='color: rgb(40,40,40)'><span  style='font-family: Romboto'><span rel='lightbox'><img class='bbc_img' src='https://emby.media/community/uploads/inline/59/5a9946dbb67ed_Watched.png' alt='Posted Image'  /></span></span></span></p><p>&nbsp;</p><p><span  style='color: rgb(40,40,40)'><span  style='font-family: Romboto'><span  style='font-size: 24px'><strong class='bbc'>Bug Fixes</strong></span></span></span><ul class='bbc'><li>Fixed the black icons on the playback overlay</li><li>The playback overlay missing overview bug has been fixed</li><li>In certain circumstances external subtitles could be skipped and this has been resolved</li><li>The issue of external subtitles showing formatting characters such as &lt;i&gt; has been resolved</li><li>Addressed views being updated when items are deleted</li></ul>We hope you enjoy these enhancements. We are hard at work on many more which will be available in the near future.</p>","Date":"2018-03-02T20:15:36.0000000+00:00"},{"Title":"Emby Server 3.3 Released","Link":"https://emby.media/community/index.php?/blog/1/entry-417-emby-server-33-released/","Description":"A new release of Emby Server is currently rolling out. Here are the highlights.&nbsp;Bug FixesResolve occasional error with dynamic image generationFix music albums getting release year of 9999Resolve Chromecast timeout when network disconnectedFix user data not showing in playlist itemsResolve issues when deleting live tv recordings from pluginsFix audio image extractionFix accent quotes in searchFix external subtitles causing longer library scans and repeat kodi syncingFix music transcoding not respecting requested bitrate&nbsp;Other ImprovementsReduce dlna play to trafficDisplay default directory in directory browser for QNAP & TerramasterUpdate design of Play On menuShow photos in search resultsImprove automatic refreshing on secondary list screensRevamp sorting and view settings on secondary list screensImprove offloading of transcoding to HDHRAdd SubDB subtitle providerUpdate HLS manifests to include framerate informationAdd new lan networks setting to configure local network addressesSupport codec folders with cinema mode, see wiki: https://github.com/MediaBrowser/Wiki/wiki/Cinema-Mode","DescriptionHtml":"<p>A new release of Emby Server is currently rolling out. Here are the highlights.</p><p>&nbsp;</p><p><span  style='font-size: 24px'>Bug Fixes</span><ul class='bbc'><li>Resolve occasional error with dynamic image generation</li><li>Fix music albums getting release year of 9999</li><li>Resolve Chromecast timeout when network disconnected</li><li>Fix user data not showing in playlist items</li><li>Resolve issues when deleting live tv recordings from plugins</li><li>Fix audio image extraction</li><li>Fix accent quotes in search</li><li>Fix external subtitles causing longer library scans and repeat kodi syncing</li><li>Fix music transcoding not respecting requested bitrate</li></ul></p><p>&nbsp;</p><p><span  style='font-size: 24px'>Other Improvements</span><ul class='bbc'><li>Reduce dlna play to traffic</li><li>Display default directory in directory browser for QNAP & Terramaster</li><li>Update design of Play On menu</li><li>Show photos in search results</li><li>Improve automatic refreshing on secondary list screens</li><li>Revamp sorting and view settings on secondary list screens</li><li>Improve offloading of transcoding to HDHR</li><li>Add SubDB subtitle provider</li><li>Update HLS manifests to include framerate information</li><li>Add new lan networks setting to configure local network addresses</li><li>Support codec folders with cinema mode, see wiki: <a href='https://github.com/MediaBrowser/Wiki/wiki/Cinema-Mode' class='bbc_url' title='External link' rel='nofollow external'>https://github.com/MediaBrowser/Wiki/wiki/Cinema-Mode</a></li></ul></p>","Date":"2018-02-27T20:21:00.0000000+00:00"},{"Title":"Emby Server 3.2.70 Released","Link":"https://emby.media/community/index.php?/blog/1/entry-416-emby-server-3270-released/","Description":"A new release of Emby Server is currently rolling out. Here are the highlights.&nbsp;Faster Live TV Start Time&nbsp;Enjoy faster than ever live tv start time in this new release !&nbsp;Support Hauppauge Tuners for Windows&nbsp;Emby Server for Windows now has native support for Hauppauge TV tuners. Make sure to install the latest Hauppauge software from the Hauppauge website. Happy tuning.&nbsp;Bug FixesFix Dlna crashFix moviedb urlsFix subtitle savingFix manual cancellations within a series recordingFix tvshow.nfo saving error&nbsp;Other ImprovementsImprove library scan performanceSupport additional multi-version naming conventionsMove folder.xml support to XmlMetadata pluginAdd active program shading to tv guideReduce dlna trafficHandle nfo saver errors with custom provider namesAdd setting to enable or disable remote accessUpdate startup wizard with remote access settingsAdd m3u tuner setting to define custom user agentSupport custom user agent for xmltv","DescriptionHtml":"<p>A new release of Emby Server is currently rolling out. Here are the highlights.</p><p>&nbsp;</p><p><span  style='font-size: 24px'>Faster Live TV Start Time</span></p><p>&nbsp;</p><p>Enjoy faster than ever live tv start time in this new release !</p><p>&nbsp;</p><p><span  style='font-size: 24px'>Support Hauppauge Tuners for Windows</span></p><p>&nbsp;</p><p>Emby Server for Windows now has native support for Hauppauge TV tuners. Make sure to install the latest Hauppauge software from the Hauppauge website. Happy tuning.</p><p>&nbsp;</p><p><span  style='font-size: 24px'>Bug Fixes</span><ul class='bbc'><li>Fix Dlna crash</li><li>Fix moviedb urls</li><li>Fix subtitle saving</li><li>Fix manual cancellations within a series recording</li><li>Fix tvshow.nfo saving error</li></ul></p><p>&nbsp;</p><p><span  style='font-size: 24px'>Other Improvements</span><ul class='bbc'><li>Improve library scan performance</li><li>Support additional multi-version naming conventions</li><li>Move folder.xml support to XmlMetadata plugin</li><li>Add active program shading to tv guide</li><li>Reduce dlna traffic</li><li>Handle nfo saver errors with custom provider names</li><li>Add setting to enable or disable remote access</li><li>Update startup wizard with remote access settings</li><li>Add m3u tuner setting to define custom user agent</li><li>Support custom user agent for xmltv</li></ul></p>","Date":"2018-01-19T20:08:00.0000000+00:00"},{"Title":"Emby Server 3.2.60 Released","Link":"https://emby.media/community/index.php?/blog/1/entry-415-emby-server-3260-released/","Description":"A new release is rolling out. Here are the highlights.&nbsp;Important Information for Windows Users&nbsp;If you're currently running Emby Server 3.2.36, you'll need to install this update manually. To do this, simply shutdown Emby Server and run the installer from the website on top of your existing installation. If you're not sure what version you're currently running, then we also suggest updating this way.&nbsp;Improved Multi-Version Support&nbsp;If you have multiple versions of a video, now you can choose which one you'd like to play prior to playback.&nbsp;&nbsp;Learn more about multi-version support in our video naming guide.&nbsp;Support Track Selection Prior to Playback&nbsp;Now you can select audio and subtitles prior to playback.&nbsp;Bug FixesResolve issues with windows uninstallerFix server update scheduled task progress reportingFix server dashboard occasionally not being scrollableFix initial audio stream selection in certain direct play situationsFix windows network browsingFix windows sleep preventionClean up LoaderException from log file under Linux and MacOSFix music transcoding for iOS&nbsp;Other ImprovementsAllow specification of m3u stream limitSupport configurable subtitle download locationAdd resiliency for customized transcode temp folder that is unreachableImprove resiliency to moving server program data folderSupport m3u tuner stream sharingMake music landing screen configurableImprove metadata saving error handlingImprove web app playback error handlingAdd fixes for m3u stream sharing featureImprove image processing performanceImprove xml tv .gz file supportSupport external subtitles with .strm filesAdd setting to auto-run web app when server startsImprove support for moviedb urls in nfo metadataAdd HLS attributes for Apple TV refresh rate switchingDelete 0-byte recording files after recording failuresAdjust rules for sample filesImprove live tv playback performance with external live tv servicesImprove tvdb lookup by imdb idShow favorite collections and playlistsImprove in browser support for ASS/SSA subtitlesSupport play start indexImprove live tv recording imagesImprove live tv stream re-use featureReduce dlna chatterUpdate save metadata as hidden file setting to be windows-onlyUpdate realtime monitor for MacOSImprove direct play of active live tv recordingsImprove LG Dlna direct playImprove automatic home screen refreshingImprove xmltv .gz supportSupport de-interlacing with vaapiSupport provider id's contained in xmltv dataSpeed up dlna server disposal","DescriptionHtml":"<p>A new release is rolling out. Here are the highlights.</p><p>&nbsp;</p><p><span  style='font-size: 24px'>Important Information for Windows Users</span></p><p>&nbsp;</p><p>If you're currently running Emby Server 3.2.36, you'll need to install this update manually. To do this, simply shutdown Emby Server and run the installer from the website on top of your existing installation. If you're not sure what version you're currently running, then we also suggest updating this way.</p><p>&nbsp;</p><p><span  style='font-size: 24px'>Improved Multi-Version Support</span></p><p>&nbsp;</p><p>If you have multiple versions of a video, now you can choose which one you'd like to play prior to playback.</p><p>&nbsp;</p><p><span rel='lightbox'><img class='bbc_img' src='https://emby.media/community/uploads/inline/2/5a3e9cbc9cad5_Untitled.png' alt='Posted Image'  /></span></p><p>&nbsp;</p><p>Learn more about multi-version support in our <a href='https://github.com/MediaBrowser/Wiki/wiki/Movie%20naming' class='bbc_url' title='External link' rel='nofollow external'>video naming guide</a>.</p><p>&nbsp;</p><p><span  style='font-size: 24px'>Support Track Selection Prior to Playback</span></p><p>&nbsp;</p><p>Now you can select audio and subtitles prior to playback.<br /><span rel='lightbox'><img class='bbc_img' src='https://emby.media/community/uploads/inline/2/5a3e9cea6f1e1_Untitled.png' alt='Posted Image'  /></span></p><p>&nbsp;</p><p><span  style='font-size: 24px'>Bug Fixes</span><ul class='bbc'><li>Resolve issues with windows uninstaller</li><li>Fix server update scheduled task progress reporting</li><li>Fix server dashboard occasionally not being scrollable</li><li>Fix initial audio stream selection in certain direct play situations</li><li>Fix windows network browsing</li><li>Fix windows sleep prevention</li><li>Clean up LoaderException from log file under Linux and MacOS</li><li>Fix music transcoding for iOS</li></ul></p><p>&nbsp;</p><p><span  style='font-size: 24px'>Other Improvements</span><ul class='bbc'><li>Allow specification of m3u stream limit</li><li>Support configurable subtitle download location</li><li>Add resiliency for customized transcode temp folder that is unreachable</li><li>Improve resiliency to moving server program data folder</li><li>Support m3u tuner stream sharing</li><li>Make music landing screen configurable</li><li>Improve metadata saving error handling</li><li>Improve web app playback error handling</li><li>Add fixes for m3u stream sharing feature</li><li>Improve image processing performance</li><li>Improve xml tv .gz file support</li><li>Support external subtitles with .strm files</li><li>Add setting to auto-run web app when server starts</li><li>Improve support for moviedb urls in nfo metadata</li><li>Add HLS attributes for Apple TV refresh rate switching</li><li>Delete 0-byte recording files after recording failures</li><li>Adjust rules for sample files</li><li>Improve live tv playback performance with external live tv services</li><li>Improve tvdb lookup by imdb id</li><li>Show favorite collections and playlists</li><li>Improve in browser support for ASS/SSA subtitles</li><li>Support play start index</li><li>Improve live tv recording images</li><li>Improve live tv stream re-use feature</li><li>Reduce dlna chatter</li><li>Update save metadata as hidden file setting to be windows-only</li><li>Update realtime monitor for MacOS</li><li>Improve direct play of active live tv recordings</li><li>Improve LG Dlna direct playImprove automatic home screen refreshing</li><li>Improve xmltv .gz support</li><li>Support de-interlacing with vaapi</li><li>Support provider id's contained in xmltv data</li><li>Speed up dlna server disposal</li></ul></p>","Date":"2017-12-23T18:10:00.0000000+00:00"}]